Autodesk.Revit.DB.BoundarySegment.Curve
Get the curve that is formed by the element that defines the edge of this area.

Autodesk.Revit.DB.BoundarySegment.Element
Retrieve the element that is responsible for producing this boundary segment.
Remarks: The element property is useful for finding all the elements that bound a specific area.

Autodesk.Revit.DB.BoundarySegment.Document
Provides the document in which the element that created this segment resides.

Autodesk.Revit.DB.BoundarySegment
An object that represents a segment of an area boundary.
Remarks: These objects define the exterior boundary of an area. The geometry of the
segment can be retrieved along with the element that is responsible for producing that
boundary.